[
  {
    "_id": {"$oid": "65d36aea4697cd06a2b51eb2"},
    "__v": 0,
    "by": {"$oid": "65d367864697cd06a2b51cc6"},
    "code": "JS",
    "createdAt": {"$date": "2024-02-19T14:51:22.237Z"},
    "description": "Học Javascript cơ bản phù hợp cho người chưa từng học lập trình. Với hơn 100 bài học và có bài tập thực hành sau mỗi bài học.",
    "image": "https://storage.googleapis.com/coursera-replica.appspot.com/images/1708354281370.jpg",
    "isHot": true,
    "isNew": true,
    "lessons": [],
    "name": "Javascript cơ bản",
    "price": 0,
    "rating": 5,
    "requirements": ["Máy vi tính kết nối internet (Windows, Ubuntu hoặc MacOS)", "  Ý thức tự học cao, trách nhiệm cao, kiên trì bền bỉ không ngại cái khó", "  Không được nóng vội, bình tĩnh học, làm bài tập sau mỗi bài học"],
    "reviews": [
      {"$oid": "65d36b674697cd06a2b51f92"}
    ],
    "sale": 0,
    "skills": ["Hiểu chi tiết về các khái niệm cơ bản trong JS", "  Xây dựng được website đầu tiên kết hợp với JS", "  Tự tin khi phỏng vấn với kiến thức vững chắc", "  Có nền tảng để học các thư viện và framework JS", "  Nắm chắc các tính năng trong phiên bản ES6", "  Thành thạo DOM APIs để tương tác với trang web", "  Ghi nhớ các khái niệm nhờ bài tập trắc nghiệm\nNâng cao tư duy với các bài kiểm tra với testcases"],
    "slug": "javascript-co-ban",
    "status": 1,
    "type": 2,
    "updateBy": {"$oid": "65d369734697cd06a2b51d7e"},
    "updatedAt": {"$date": "2024-02-19T14:53:27.224Z"}
  },
  {
    "_id": {"$oid": "65d9ddb442380a9159d35912"},
    "__v": 0,
    "by": {"$oid": "65d367864697cd06a2b51cc6"},
    "code": "JS nâng cao",
    "createdAt": {"$date": "2024-02-24T12:14:44.001Z"},
    "description": "Hiểu sâu hơn về cách Javascript hoạt động, tìm hiểu về IIFE, closure, reference types, this keyword, bind, call, apply, prototype, ...",
    "image": "https://storage.googleapis.com/coursera-replica.appspot.com/images/1708776880533.jpg",
    "isHot": true,
    "isNew": true,
    "lessons": [
      {"$oid": "65d9de5842380a9159d359a7"}
    ],
    "name": "Lập Trình JavaScript Nâng Cao",
    "price": 0,
    "rating": 5,
    "requirements": ["Hoàn thành khóa học Javascript cơ bản tại F8 hoặc đã nắm chắc Javascript cơ bản", " Tuy duy mở để dễ dàng tiếp nhận các tư tưởng mới được chia sẻ trong các bài học", " Máy vi tính kết nối internet (Windows, Ubuntu hoặc MacOS)", " Ý thức cao, trách nhiệm cao trong việc tự học. Thực hành lại sau mỗi bài học", " Khi học nếu có khúc mắc hãy tham gia hỏi/đáp tại group FB: Học lập trình web (fullstack.edu.vn)\nBạn không cần biết gì hơn nữa, trong khóa học tôi sẽ chỉ cho bạn những gì bạn cần phải biết"],
    "reviews": [
      {"$oid": "65db21627408538c1e4cc908"}
    ],
    "sale": 0,
    "skills": ["Được học kiến thức miễn phí với nội dung chất lượng hơn mất phí\nCác kiến thức nâng cao của Javascript giúp code trở nên tối ưu hơn", " Hiểu được cách tư duy nâng cao của các lập trình viên có kinh nghiệm", " Hiểu được các khái niệm khó như từ khóa this, phương thức bind, call, apply & xử lý bất đồng bộ", " Có nền tảng Javascript vững chắc để làm việc với mọi thư viện, framework viết bởi Javascript", " Nâng cao cơ hội thành công khi phỏng vấn xin việc nhờ kiến thức chuyên môn vững chắc"],
    "slug": "lap-trinh-javascript-nang-cao",
    "status": 1,
    "type": 2,
    "updateBy": {"$oid": "65d367864697cd06a2b51cc6"},
    "updatedAt": {"$date": "2024-02-25T11:15:47.053Z"}
  },
  {
    "_id": {"$oid": "65d9e61442380a9159d36254"},
    "__v": 0,
    "by": {"$oid": "65d367864697cd06a2b51cc6"},
    "code": "HTML CSS",
    "createdAt": {"$date": "2024-02-24T12:50:28.315Z"},
    "description": "Trong khóa này chúng ta sẽ cùng nhau xây dựng giao diện 2 trang web là The Band & Shopee.\r\n",
    "image": "https://storage.googleapis.com/coursera-replica.appspot.com/images/1708779026132.png",
    "isHot": false,
    "isNew": true,
    "lessons": [
      {"$oid": "65d9f14642380a9159d36d96"},
      {"$oid": "65d9f1c042380a9159d36ede"},
      {"$oid": "65d9f22c42380a9159d36f7d"},
      {"$oid": "65da2475059a4ddf9c628a6b"},
      {"$oid": "65da24a9059a4ddf9c628abc"},
      {"$oid": "65da24d3059a4ddf9c628b05"}
    ],
    "name": "HTML CSS từ Zero đến Hero",
    "price": 123000,
    "rating": 5,
    "requirements": [],
    "reviews": [],
    "sale": 0,
    "skills": ["Biết cách xây dựng giao diện web với HTML, CSS", "Biết cách phân tích giao diện website", "Biết cách đặt tên class CSS theo chuẩn BEM", "Biết cách làm giao diện web responsive", "Làm chủ Flexbox khi dựng bố cục website", "Sở hữu 2 giao diện web khi học xong khóa học", "Biết cách tự tạo động lực cho bản thân", "Biết cách tự học những kiến thức mới", "Học được cách làm UI chỉn chu, kỹ tính"],
    "slug": "html-css-tu-zero-den-hero",
    "status": 1,
    "type": 2,
    "updateBy": {"$oid": "65d367864697cd06a2b51cc6"},
    "updatedAt": {"$date": "2024-02-25T11:13:42.495Z"}
  },
  {
    "_id": {"$oid": "65d9e74c42380a9159d36325"},
    "__v": 0,
    "by": {"$oid": "65d367864697cd06a2b51cc6"},
    "code": "Visual Design",
    "description": "Cracking the code to great design is much easier with a solid foundation of core principles. Join designers Ellen Lupton and Jennifer Cole Phillips for an essential, 35-minute class as they walk through 5 basic principles of graphic design, perfect for use in all projects using images and type — creative design, marketing materials, and even photography!\r\nThe lessons include both examples and demonstration, giving you a foundation to create inspired, functional design. You’ll learn to:\r\nIdentify and define 5 basic design principles\r\nCritique your work for effectiveness and balance\r\nApply each core concept in future projects\r\nEllen and Jennifer are co-directors of the Graphic Design MFA Program at the Maryland Institute College of Art (MICA). This class is directly inspired by their popular textbook, now in its second edition: Graphic Design: The New Basics, available online as well as through Princeton Architectural Press. Whether you're new to these principles or are looking for a refresher, you'll gain a solid understanding of the visual language that fuels all great design.",
    "image": "https://storage.googleapis.com/coursera-replica.appspot.com/images/1708779338244.jpg",
    "isHot": true,
    "isNew": false,
    "lessons": [
      {"$oid": "65d9fee342380a9159d37851"}
    ],
    "name": "Graphic Design Basics: Core Principles for Visual Design",
    "price": 126000,
    "rating": 5,
    "requirements": [],
    "reviews": [],
    "sale": 0,
    "skills": ["Introduction. Ellen Lupton and Jennifer Cole Phillips will lay out the 5 basic principles of graphic design — symmetry, scale, framing, hierarchy, and grids — and preview what you’ll learn in the rest of their design course.\nSymmetry vs. asymmetry. Ellen will expound on her love for symmetry in design, and Jennifer will talk about her passion for asymmetry. You’ll learn how both should employ balance and can be dynamic, especially with the introduction of contrasting colors, shapes, and patterns.\nScale. Scale is about size, but more than that, it’s about relationships. Ellen and Jennifer will explain how these relationships can tell a visual story by creating tension and energy on (and with) the page. You’ll discover how to surprise an audience using scale by playing with their expectations, and you’ll learn how scale can take on an especially important role in business logo design.\nFraming. “Every time you change the cropping in Instagram, you’re framing,” Ellen says, and it’s true — framing is something you already do all the time. In this lesson, you’ll learn how prevalent framing is in the design process and get introduced to the 3 main types of framing: margins, bleeds, and partial bleeds.\nHierarchy. The keys to hierarchy are separation and difference. You’ll see how to use the two to order information and direct readers across a text — important lessons to keep in mind when creating logos. Ellen and Jennifer will go over an exercise in which you’ll apply hierarchy to a plain block of text, and you’ll learn the usefulness of color when it comes to textual hierarchy.\nGrids. A grid is a powerful tool for bringing structure and efficiency to your page design. In exploring different grids, you’ll learn the difference between margins and gutters, how blank space doesn’t have to feel like empty space, and how to make a basic grid in Adobe InDesign. You’ll also examine the difference between web and print grids."],
    "slug": "graphic-design-basics:-core-principles-for-visual-design",
    "status": 1,
    "type": 4,
    "updateBy": {"$oid": "65d367864697cd06a2b51cc6"},
    "updatedAt": {"$date": "2024-02-24T14:36:19.975Z"}
  },
  {
    "_id": {"$oid": "65d9e87a42380a9159d365c2"},
    "__v": 0,
    "by": {"$oid": "65d367864697cd06a2b51cc6"},
    "code": "Creating Brand Systems",
    "createdAt": {"$date": "2024-02-24T13:00:42.578Z"},
    "description": "Create and/or share a favorite logo system.",
    "image": "https://storage.googleapis.com/coursera-replica.appspot.com/images/1708779640340.jpg",
    "isHot": false,
    "isNew": true,
    "lessons": [],
    "name": "Creating Brand Systems: An Overview of Combining Logos and Type",
    "price": 0,
    "rating": 5,
    "requirements": [],
    "reviews": [],
    "sale": 0,
    "skills": ["How does a great logo or brand system come to be?\nThis inspiring short class is perfect for designers, illustrators, creatives, and enthusiasts eager for a high-level walk-through of what goes into creating a dynamic logo for use across many applications and channels.\nDesigners Mike Ski and Jessie Jay of True Hand discuss and describe their collaborative process for creating the logo for Philadelphia eatery Kensington Quarters.\nAlong the way, they offer prompts so that you leave inspired to create an amazing, adaptable logo for a project of your own — one that communicates your brand and conveys your values."],
    "slug": "creating-brand-systems:-an-overview-of-combining-logos-and-type",
    "status": 1,
    "type": 4,
    "updatedAt": {"$date": "2024-02-24T13:00:42.578Z"}
  },
  {
    "_id": {"$oid": "65d9e97d42380a9159d368c7"},
    "__v": 0,
    "by": {"$oid": "65d367864697cd06a2b51cc6"},
    "code": "Learn Korean ",
    "createdAt": {"$date": "2024-02-24T13:05:01.186Z"},
    "description": "This is an elementary-level Korean language course, consisting of 5 lessons with 4 units, and covers 4 skills: reading, writing, listening and speaking. The main topics include basic expressions used in everyday life, such as greetings, introducing yourself, talking about your family and a daily life and so on. Each lesson covers dialogues, pronunciation, vocabulary, grammar, quizzes and role-plays. ",
    "image": "https://storage.googleapis.com/coursera-replica.appspot.com/images/1708779898213.jpg",
    "isHot": false,
    "isNew": true,
    "lessons": [],
    "name": "First Step Korean",
    "price": 21391,
    "rating": 5,
    "requirements": [],
    "reviews": [],
    "sale": 0,
    "skills": ["After completing this course, you will be able to\n1. read and write Korean alphabet.\n2. communicate in Korean with basic expressions.\n3. learn basic knowledge on Korean culture.\nIt’s fun and easy to follow! Enjoy it!"],
    "slug": "first-step-korean",
    "status": 1,
    "type": 1,
    "updateBy": {"$oid": "65d367864697cd06a2b51cc6"},
    "updatedAt": {"$date": "2024-02-24T13:07:51.379Z"}
  },
  {
    "_id": {"$oid": "65d9e9f842380a9159d36978"},
    "__v": 0,
    "by": {"$oid": "65d367864697cd06a2b51cc6"},
    "code": "Learn Chinese",
    "createdAt": {"$date": "2024-02-24T13:07:04.539Z"},
    "description": "",
    "image": "https://storage.googleapis.com/coursera-replica.appspot.com/images/1708780022786.png",
    "isHot": false,
    "isNew": true,
    "lessons": [],
    "name": "Chinese for Beginners",
    "price": 0,
    "rating": 5,
    "requirements": [],
    "reviews": [],
    "sale": 0,
    "skills": ["Immerse yourself in the captivating world of Chinese culture and language with our ABC Chinese course for beginners", " This comprehensive course provides an introduction to Mandarin phonetics and essential daily expressions, enabling learners to achieve a fundamental understanding and confidently engage in basic conversations.\n\nOur carefully crafted curriculum covers practical topics and real-life situations, ranging from exchanging personal information and discussing daily schedules to conversing about food, prices, city life, weather, and hobbies. The diverse selection of reading materials and interactive activities ensures a rich and stimulating learning experience, piquing learners' interests throughout the course.\n\nNo need to worry about learning Chinese characters – this course focuses on speaking skills, making it accessible and enjoyable.\n\nElevate your learning with a thrilling bonus feature: virtually travel to China and hone your speaking skills with our immersive game, playable on a VR headset or desktop. Embark on a scavenger hunt, talk to vendors, encounter fellow travelers, and explore a traditional market, all while applying your Chinese skills in a real-world environment."],
    "slug": "chinese-for-beginners",
    "status": 1,
    "type": 1,
    "updateBy": {"$oid": "65d367864697cd06a2b51cc6"},
    "updatedAt": {"$date": "2024-02-25T11:13:11.847Z"}
  },
  {
    "_id": {"$oid": "65d9ea8f42380a9159d36a71"},
    "__v": 0,
    "by": {"$oid": "65d367864697cd06a2b51cc6"},
    "code": "Learn French",
    "createdAt": {"$date": "2024-02-24T13:09:35.312Z"},
    "description": "Ce cours a été financé grâce au soutien de l’Université Paris-Saclay et celui de la fondation Patrick et Lina Drahi.\r\n\r\n« l’Ecole polytechnique vous concède une licence personnelle, non exclusive et non transférable vous permettant d’accéder et d’utiliser les contenus diffusés sur le site Coursera. En aucun cas, vous ne pouvez exploiter, de quelle que manière que ce soit les contenus diffusés sur le site Coursera, à d’autres fins que des fins personnelles. Toute reproduction, diffusion et utilisation collective à quelque titre que ce soit, tout usage commercial, ou toute mise à disposition de tiers, en l’état ou modifiés, de contenus, de cours ou d’œuvres intégrées à ceux-ci sont strictement interdits ",
    "image": "https://storage.googleapis.com/coursera-replica.appspot.com/images/1708780173561.png",
    "isHot": true,
    "isNew": true,
    "lessons": [],
    "name": "Étudier en France: French Intermediate course B1-B2",
    "price": 12717234,
    "rating": 5,
    "requirements": [],
    "reviews": [],
    "sale": 0,
    "skills": ["Ce cours de français de niveau intermédiaire B1/B2, conforme aux exigences du Cadre européen de Référence pour les Langues, s’inscrit dans le double dispositif “former avec le numérique”et “langue et interculturalité” mis en place par l’Université Paris Saclay. Il s’adresse à tous les étudiants souhaitant poursuivre leurs études supérieures en France. Il leur permettra non seulement d’avoir le niveau requis en français pour suivre des cours dans le système supérieur français en termes de compétences linguistiques, mais les aidera à s’adapter à leur nouvel environnement dans les meilleures conditions. \n\nCe cours propose en effet une immersion dans l’univers étudiant à travers des vidéos de cours, des textes de multiples formats, de courts extraits de films et de vidéos authentiques qui donnent la parole à des étudiants français ou étrangers vivant en France. Les étudiants pourront ainsi travailler toutes les compétences (compréhension orale et écrite, expression orale et écrite, grammaire et vocabulaire), puis tester ensuite leurs acquis grâce aux nombreux quiz proposés et, chaque semaine, ils auront aussi la possibilité de participer aux débats et aux discussions organisés sur le forum. \nDécouvrir la vie en France et dans le monde francophone à travers ses cultures, ses littératures, ses films, ses journaux télévisés et sa langue (standard et plus familière) et comprendre le système d’enseignement supérieur français (assister à un cours magistral, comprendre le fonctionnement de l’évaluation …) : voici quelques-uns des enjeux de ce cours. Ses objectifs sont donc langagiers, mais aussi culturels et pratiques !\nNote importante: ce Mooc ne remplace pas la passation de tests attestant du niveau B1 ou B2 tels que ceux proposés par le Ciep: TCF, Delf ou Dalf.\n"],
    "slug": "etudier-en-france:-french-intermediate-course-b1-b2",
    "status": 1,
    "type": 1,
    "updatedAt": {"$date": "2024-02-24T13:09:35.312Z"}
  },
  {
    "_id": {"$oid": "65d9eb2042380a9159d36b46"},
    "__v": 0,
    "by": {"$oid": "65d367864697cd06a2b51cc6"},
    "code": "Psychology",
    "description": "To be honest, it was an overwhelming course for me. It has expanded my eyesight and way of thinking. Hopefully, the acquired knowledge from this course will help me in my personal and practical life.\r\n\r\n",
    "image": "https://storage.googleapis.com/coursera-replica.appspot.com/images/1708780318061.png",
    "isHot": false,
    "isNew": false,
    "lessons": [],
    "name": "Introduction to Psychology",
    "price": 0,
    "rating": 5,
    "requirements": [],
    "reviews": [],
    "sale": 0,
    "skills": ["What are people most afraid of? What do our dreams mean? Are we natural-born racists? What makes us happy? What are the causes and cures of mental illness? This course tries to answer these questions and many others, providing a comprehensive overview of the scientific study of thought and behavior. It explores topics such as perception, communication, learning, memory, decision-making, persuasion, emotions, and social behavior.  We will look at how these aspects of the mind develop in children, how they differ across people, how they are wired-up in the brain, and how they break down due to illness and injury."],
    "slug": "introduction-to-psychology",
    "status": 1,
    "type": 3,
    "updatedAt": {"$date": "2024-02-24T13:12:00.554Z"}
  },
  {
    "_id": {"$oid": "65d9fb6d42380a9159d37229"},
    "__v": 0,
    "by": {"$oid": "65d367864697cd06a2b51cc6"},
    "code": "English Communication Skill",
    "createdAt": {"$date": "2024-02-24T14:21:33.925Z"},
    "description": "Improve Your English Communication Skills. Write and speak more professionally in English to increase your business success.",
    "image": "https://storage.googleapis.com/coursera-replica.appspot.com/images/1708784491193.png",
    "isHot": true,
    "isNew": true,
    "lessons": [],
    "name": "Improve Your English Communication Skills Specialization",
    "price": 0,
    "rating": 5,
    "requirements": [],
    "reviews": [],
    "sale": 0,
    "skills": ["Learn in-demand skills from university and industry experts", "Master a subject or tool with hands-on projects", "Develop a deep understanding of key concepts", "Earn a career certificate from Georgia Institute of Technology"],
    "slug": "improve-your-english-communication-skills-specialization",
    "status": 1,
    "type": 1,
    "updateBy": {"$oid": "65d367864697cd06a2b51cc6"},
    "updatedAt": {"$date": "2024-02-25T11:12:43.855Z"}
  },
  {
    "_id": {"$oid": "65da177d90acc95dd805f158"},
    "__v": 0,
    "by": {"$oid": "65d367864697cd06a2b51cc6"},
    "code": "Node",
    "createdAt": {"$date": "2024-02-24T16:21:17.264Z"},
    "description": "Học Back-end với Node & ExpressJS framework, hiểu các khái niệm khi làm Back-end và xây dựng RESTful API cho trang web.\r\n",
    "image": "https://storage.googleapis.com/coursera-replica.appspot.com/images/1708791673649.png",
    "isHot": true,
    "isNew": true,
    "lessons": [
      {"$oid": "65da256a059a4ddf9c628c26"},
      {"$oid": "65da25b2059a4ddf9c628c6f"},
      {"$oid": "65da25d7059a4ddf9c628cb8"}
    ],
    "name": "Node & ExpressJS",
    "price": 136174,
    "rating": 5,
    "requirements": ["Có kiến thức cơ bản về HTML, CSS và Javascript", "Nắm chắc các tính năng trong Javascript ES6", "Có hiểu biết về lập trình bất đồng bộ trong Javascript", "Sở hữu máy tính kết nối internet HDH Windows, Ubuntu hoặc MacOS", "Ý thức cao, trách nhiệm cao trong việc tự học. Thực hành lại sau mỗi bài học", "Khi học nếu có khúc mắc hãy tham gia hỏi/đáp tại group FB: Học lập trình web (fullstack.edu.vn)\nBạn không cần biết gì hơn nữa, trong khóa học tôi sẽ chỉ cho bạn những gì bạn cần phải biết"],
    "reviews": [],
    "sale": 0,
    "skills": ["Nắm chắc lý thuyết chung trong việc xây dựng web", "Biết cách làm việc với Mongoose, MongoDB trong NodeJS", "Xây dựng web với Express bằng kiến thức thực tế", "Biết cách xây dựng API theo chuẩn RESTful API", "Nắm chắc lý thuyết về API và RESTful API", "Được chia sẻ lại kinh nghiệm làm việc thực tế", "Nắm chắc khái niệm về giao thức HTTP", "Hiểu rõ tư tưởng và cách hoạt động của mô hình MVC\nHọc được cách tổ chức code trong thực tế\nBiết cách deploy (triển khai) website lên internet"],
    "slug": "node-&-expressjs",
    "status": 1,
    "type": 2,
    "updateBy": {"$oid": "65d367864697cd06a2b51cc6"},
    "updatedAt": {"$date": "2024-02-25T11:12:25.277Z"}
  }
]